
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9928372387)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.cloudsql.google_sql_database.database
  * module.cloudsql.google_sql_database_instance.default
  * module.cloudsql.google_sql_user.gauser
  * module.cloudsql.random_id.mysql_gauser_password
* Delete
  * module.spanner.google_spanner_database.database
  * module.spanner.google_spanner_instance.default


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudsql.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = "utf8"
      + collation       = "utf8_general_ci"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "ga-terraform"
      + name            = "books"
      + project         = "grasys-study"
      + self_link       = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "ga-terraform"
      + private_ip_address             = (known after apply)
      + project                        = "grasys-study"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + location                       = "asia"
              + start_time                     = "00:00"
              + transaction_log_retention_days = 5

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = false
              + ipv4_enabled                                  = false
              + private_network                               = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
              + require_ssl                                   = false
              + ssl_mode                                      = (known after apply)
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.cloudsql.google_sql_user.gauser will be created
  + resource "google_sql_user" "gauser" {
      + host                    = "%"
      + id                      = (known after apply)
      + instance                = "ga-terraform"
      + name                    = "gauser"
      + password                = (sensitive value)
      + project                 = "grasys-study"
      + sql_server_user_details = (known after apply)
    }

  # module.cloudsql.random_id.mysql_gauser_password will be created
  + resource "random_id" "mysql_gauser_password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 12
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.spanner.google_spanner_database.database will be destroyed
  # (because google_spanner_database.database is not in configuration)
  - resource "google_spanner_database" "database" {
      - database_dialect         = "GOOGLE_STANDARD_SQL" -> null
      - ddl                      = [
          - "CREATE TABLE books (Id INT64 NOT NULL,) PRIMARY KEY(Id)",
        ] -> null
      - deletion_protection      = false -> null
      - enable_drop_protection   = false -> null
      - id                       = "tfgen-spanid-20240714130857939/ga-database" -> null
      - instance                 = "tfgen-spanid-20240714130857939" -> null
      - name                     = "ga-database" -> null
      - project                  = "grasys-study" -> null
      - state                    = "READY" -> null
      - version_retention_period = "3d" -> null
    }

  # module.spanner.google_spanner_instance.default will be destroyed
  # (because google_spanner_instance.default is not in configuration)
  - resource "google_spanner_instance" "default" {
      - config           = "projects/grasys-study/instanceConfigs/nam-eur-asia1" -> null
      - display_name     = "Ga Spanner Instance" -> null
      - effective_labels = {
          - "foo" = "ga"
        } -> null
      - force_destroy    = false -> null
      - id               = "grasys-study/tfgen-spanid-20240714130857939" -> null
      - labels           = {
          - "foo" = "ga"
        } -> null
      - name             = "tfgen-spanid-20240714130857939" -> null
      - num_nodes        = 1 -> null
      - processing_units = 1000 -> null
      - project          = "grasys-study" -> null
      - state            = "READY" -> null
      - terraform_labels = {
          - "foo" = "ga"
        } -> null

      - autoscaling_config {
          - autoscaling_limits {
              - max_nodes            = 2 -> null
              - max_processing_units = 0 -> null
              - min_nodes            = 1 -> null
              - min_processing_units = 0 -> null
            }

          - autoscaling_targets {
              - high_priority_cpu_utilization_percent = 75 -> null
              - storage_utilization_percent           = 90 -> null
            }
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gce.google_compute_instance.default[0] has changed
  ~ resource "google_compute_instance" "default" {
        id                      = "projects/grasys-study/zones/asia-northeast1-a/instances/jump-ops-01"
      + labels                  = {}
      + metadata                = {}
        name                    = "jump-ops-01"
      + resource_policies       = []
        tags                    = [
            "ga-firewall",
        ]
        # (17 unchanged attributes hidden)

      ~ boot_disk {
            # (4 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (7 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>


## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.cloudsql.google_sql_database_instance.default,
  on modules/cloudsql/main.tf line 19, in resource "google_sql_database_instance" "default":
  19:       require_ssl = false 

`require_ssl` will be fully deprecated in a future major release. For now,
please use `ssl_mode` with a compatible `require_ssl` value instead.

```



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":11,"Program":"tfcmt","SHA1":"29b19063bd6d644db9ee3f5ea940682054c64658","Vars":{},"WorkflowName":"terraform plan"} -->